Rahix/avr-device/vendor/at90can128.atdf
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1">
          <bitfield caption="General Purpose IO Register 2 bis" mask="0xFF" name="GPIOR" lsb="20"/>
        </register>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
          <bitfield caption="General Purpose IO Register 1 bis" mask="0xFF" name="GPIOR" lsb="10"/>
        </register>
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
          <bitfield caption="General Purpose IO Register 0 bit 7" mask="0x80" name="GPIOR07"/>
          <bitfield caption="General Purpose IO Register 0 bit 6" mask="0x40" name="GPIOR06"/>
          <bitfield caption="General Purpose IO Register 0 bit 5" mask="0x20" name="GPIOR05"/>
          <bitfield caption="General Purpose IO Register 0 bit 4" mask="0x10" name="GPIOR04"/>
          <bitfield caption="General Purpose IO Register 0 bit 3" mask="0x08" name="GPIOR03"/>
          <bitfield caption="General Purpose IO Register 0 bit 2" mask="0x04" name="GPIOR02"/>
          <bitfield caption="General Purpose IO Register 0 bit 1" mask="0x02" name="GPIOR01"/>
          <bitfield caption="General Purpose IO Register 0 bit 0" mask="0x01" name="GPIOR00"/>
        </register>
      </register-group>
      <value-group name="CPU_SECTOR_LIMITS_XMEM">
        <value caption="LS = N/A, US = 0x1100 - 0xFFFF" name="LS_N_A_US_0X1100_0XFFFF" value="0x00"/>
        <value caption="LS = XMEMSTART - 0x1FFF, US = 0x2000 - 0xFFFF" name="LS_XMEMSTART_0X1FFF_US_0X2000_0XFFFF" value="0x01"/>
        <value caption="LS = XMEMSTART - 0x3FFF, US = 0x4000 - 0xFFFF" name="LS_XMEMSTART_0X3FFF_US_0X4000_0XFFFF" value="0x02"/>
        <value caption="LS = XMEMSTART - 0x5FFF, US = 0x6000 - 0xFFFF" name="LS_XMEMSTART_0X5FFF_US_0X6000_0XFFFF" value="0x03"/>
        <value caption="LS = XMEMSTART - 0x7FFF, US = 0x8000 - 0xFFFF" name="LS_XMEMSTART_0X7FFF_US_0X8000_0XFFFF" value="0x04"/>
        <value caption="LS = XMEMSTART - 0x9FFF, US = 0xA000 - 0xFFFF" name="LS_XMEMSTART_0X9FFF_US_0XA000_0XFFFF" value="0x05"/>
        <value caption="LS = XMEMSTART - 0xBFFF, US = 0xC000 - 0xFFFF" name="LS_XMEMSTART_0XBFFF_US_0XC000_0XFFFF" value="0x06"/>
        <value caption="LS = XMEMSTART - 0xDFFF, US = 0xE000 - 0xFFFF" name="LS_XMEMSTART_0XDFFF_US_0XE000_0XFFFF" value="0x07"/>
      </value-group>
      <value-group name="CPU_WAIT_STATES">
        <value caption="No wait-states" name="NO_WAIT_STATES" value="0x00"/>
        <value caption="Wait one cycle during read/write strobe" name="WAIT_ONE_CYCLE_DURING_READ_WRITE_STROBE" value="0x01"/>
        <value caption="Wait two cycles during read/write strobe" name="WAIT_TWO_CYCLES_DURING_READ_WRITE_STROBE" value="0x02"/>
        <value caption="Wait two cycles during read/write and wait one cycle before driving out new address" name="WAIT_TWO_CYCLES_DURING_READ_WRITE_AND_WAIT_ONE_CYCLE_BEFORE_DRIVING_OUT_NEW_ADDRESS" value="0x03"/>
      </value-group>
      <value-group name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="1" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
        <value caption="256" name="256" value="0x08"/>
      </value-group>
      <value-group name="CPU_SLEEP_MODE_3BITS2">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Control Register B" name="EICRB" offset="0x6A" size="1">
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0xC0" name="ISC7" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x30" name="ISC6" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x0C" name="ISC5" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x03" name="ISC4" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request 7 Enable" mask="0xFF" name="INT"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0xFF" name="INTF"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="ANY_LOGICAL_CHANGE_OF_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
    </module>
